{
  "citiFxProject": {
    "projectName": "Citi FX Velocity and Citi FX Pulse",
    "technologiesUsed": [
      "Angular",
      "JavaScript (ES6)",
      "HTML5",
      "CSS3",
      "Jenkins",
      "GitHub",
      "Artifactory",
      "UDeploy",
      "Docker",
      "Kubernetes",
      "Karma",
      "Jasmine",
      "JIRA",
      "TypeScript"
    ],
    "responsibilities": [
      "Developed and maintained responsive front-end components using Angular, JavaScript (ES6), HTML5, and CSS3, enhancing user experience for institutional clients on Citi FX Velocity and Citi FX Pulse.",
      "Implemented and optimized CI/CD pipelines utilizing Jenkins, GitHub, Artifactory, and UDeploy, ensuring efficient and reliable deployments for CitiFX Pulse.",
      "Containerized applications with Docker and managed orchestration using Kubernetes, facilitating scalable deployments across multiple environments.",
      "Conducted unit and integration testing with Karma and Jasmine, ensuring application stability and high-quality user interfaces.",
      "Collaborated with cross-functional teams, including QA, business analysts, and product owners, in an Agile environment to deliver features aligned with client needs.",
      "Facilitated knowledge-sharing sessions and walkthroughs to promote best practices and enhance team proficiency in modern development tools and frameworks.",
      "Developed custom utility scripts to automate routine tasks, improving development efficiency and reducing manual errors.",
      "Utilized JIRA for task management, sprint planning, and tracking progress, ensuring transparency and timely delivery of project milestones.",
      "Actively participated in code reviews, enforcing coding standards and promoting clean, maintainable codebases.",
      "Provided support during production releases, analyzing logs, identifying root causes of issues, and coordinating with support teams for prompt resolution.",
      "Ensured timely upgrades of project dependencies, including regular updates of TypeScript, Angular, and other key libraries, maintaining compatibility and leveraging the latest framework features."
    ],
    "projectDetails": [
      "Citi Velocity is a proprietary platform developed by Citigroup, designed to provide institutional clients with real-time access to markets, research, and trading tools across multiple asset classes. It serves as a comprehensive digital hub for clients to view analytics, make data-driven investment decisions, and execute trades with precision and speed.",
      "The application offers insights into foreign exchange, interest rates, credit, commodities, and equity markets. With its intuitive user interface, Citi Velocity allows users to access live market data, interactive charts, and economic research published by Citi’s global analysts. Advanced analytics and customizable dashboards empower traders and portfolio managers to monitor market movements and trends in real-time",
      "Citi Velocity supports electronic trading, giving clients access to liquidity and pricing with low latency. The platform integrates robust risk management and compliance features, ensuring secure and efficient transactions.",
      "Built with high-performance technologies and a focus on scalability and reliability, Citi Velocity is accessible via web and mobile, enabling clients to stay connected on the go. It stands out as a powerful solution in the competitive financial technology space, reflecting Citi’s commitment to innovation and client service. The application plays a critical role in the daily operations of many institutional investors worldwide."
    ]
  }
}
